content/publications.org
#+include: ../elements/title.org
#+include: ../elements/navigation.org

#+description: Peer-reviewed publications by Marlin P. Strub on robotics, path planning, and motion planning.

* Journal articles

#+html: <div class="pub" id="vaquero_sr2024"><span class="venue">Science Robotics<br>2024</span><div class="body">
#+html: <p class="title">EELS: Autonomous snake-like robot with task and motion planning capabilities for ice world exploration</p>
#+html: <p class="authors">T. S. Vaquero, G. Daddi, R. Thakker, M. Paton, A. Jasour, M. P. Strub, R. M. Swan, R. Royce, <i>et al.</i></p>
#+html: <div class="links"><a href="https://www.science.org/doi/full/10.1126/scirobotics.adh8332">open-access</a> · <a href="https://www.doi.org/10.1126/scirobotics.adh8332">doi</a> · <details><summary>bibtex</summary>
#+begin_src bibtex
@Article{vaquero_sr2024,
  author = {Vaquero, Tiago S. and Daddi, Guglielmo and Thakker, Rohan and Paton, Michael and Jasour, Akash and Strub, Marlin P. and Swan, R. Michael and Royce, Rob and Gildner, Matthew and Tosi, Phillipe and Veismann, Marcel and Gavrilov, Peter and Marteau, Elo\"{i}se and Bowkett, Joseph and Loret de Mola Lemus, Daniel and Nakka, Yashwanth and Hockman, Ben and Orekhov, Andrew and Hasseler, Tristan D. and Leake, Carl and Nuernberger, Benjamin and Proen\c{c}a, Pedro and Reid, William and Talbot, William and Georgiev, Nikola and Pailevanian, Torkom and Archanian, Avak and Ambrose, Eric and Jasper, Jay and Etheredge, Rachel and Roman, Christian and Levine, Dan and Otsu, Kyon and Yearicks, Sarah and Melikyan, Hovhannes and Rieber, Richard R. and Carpenter, Kalind and Nash, Jeremy and Jain, Abhinandan and Shiraishi, Lori and Robinson, Matt and Travers, Matthew and Choset, Howie and Burdick, Joel W. and Gardner, Alex and Cable, Morgan L. and Ingham, Mitch and Ono, Hiro},
  title = {{EELS}: {Autonomous} snake-like robot with task and motion planning capabilities for ice world exploration},
  journal = {Science Robotics},
  year = {2024},
  volume = {9},
  number = {88},
  pages = {1--11},
  doi = {10.1126/scirobotics.adh8332}
}
#+end_src
#+html: </details></div>
#+html: </div></div>

#+html: <div class="pub" id="thomason_ral2022"><span class="venue">RA-L 2022</span><div class="body">
#+html: <p class="title">Task and Motion Informed Trees (TMIT*): Almost-surely asymptotically optimal integrated task and motion planning</p>
#+html: <p class="authors">W. Thomason, M. P. Strub, J. D. Gammell</p>
#+html: <div class="links"><a href="https://arxiv.org/abs/2210.09367">open-access</a> · <a href="https://www.doi.org/10.1109/LRA.2022.3199676">doi</a> · <details><summary>bibtex</summary>
#+begin_src bibtex
@Article{thomason_ral2022,
  author = {Thomason, Wil and Strub, Marlin P. and Gammell, Jonathan D.},
  title = {{Task} and {Motion} {Informed} {Trees} ({TMIT*}): Almost-surely asymptotically optimal integrated task and motion planning},
  journal = {{IEEE} Robotics and Automation Letters ({RA-L})},
  year = {2022},
  volume = {7},
  number = {4},
  pages = {11370--11377},
  doi = {10.1109/LRA.2022.3199676}
}
#+end_src
#+html: </details></div>
#+html: </div></div>

#+html: <div class="pub" id="strub_ijrr2021"><span class="venue">IJRR 2022</span><div class="body">
#+html: <p class="title">AIT* and EIT*: Asymmetric bidirectional sampling-based path planning</p>
#+html: <p class="authors">M. P. Strub, J. D. Gammell</p>
#+html: <div class="links"><a href="https://arxiv.org/abs/2111.01877">open-access</a> · <a href="https://www.doi.org/10.1177/02783649211069572">doi</a> · <details><summary>bibtex</summary>
#+begin_src bibtex
@Article{strub_ijrr2021,
  author = {Strub, Marlin P. and Gammell, Jonathan D.}
  title = {{AIT*} and {EIT*}: {Asymmetric} bidirectional sampling-based path planning},
  journal = {The International Journal of Robotics Research ({IJRR})},
  year = {2022},
  volume = {41},
  number = {4},
  pages = {351--457},
  doi = {10.1177/02783649211069572}
}
#+end_src
#+html: </details></div>
#+html: </div></div>

#+html: <div class="pub" id="gammell_arcras2021"><span class="venue">ARCRAS 2021</span><div class="body">
#+html: <p class="title">Asymptotically optimal sampling-based motion planning methods</p>
#+html: <p class="authors">J. D. Gammell, M. P. Strub</p>
#+html: <div class="links"><a href="https://arxiv.org/abs/2009.10484">open-access</a> · <a href="https://www.doi.org/10.1146/annurev-control-061920-093753">doi</a> · <details><summary>bibtex</summary>
#+begin_src bibtex
@Article{gammell_arcras2021,
  author = {Gammell, Jonathan D. and Strub, Marlin P.},
  title = {Asymptotically optimal sampling-based motion planning methods},
  journal = {Annual Review of Control, Robotics, and Autonomous Systems},
  year = {2021},
  volume = {4},
  number = {1},
  pages = {295--318},
  doi = {10.1146/annurev-control-061920-093753}
}
#+end_src
#+html: </details></div>
#+html: </div></div>

