publications.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Marlin P. Strub</title>
<meta name="description" content="Peer-reviewed publications by Marlin P. Strub on robotics, path planning, and motion planning." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"><base target="_blank"><meta property="og:image" content="https://www.marlinstrub.com/assets/profile_picture.jpg"><link rel="icon" type="image/svg+xml" href="/assets/favicon.svg"><link rel="icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/assets/apple-touch-icon.png">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Marlin P. Strub
<br />
<span class="subtitle">Roboticist and C++ enthusiast</span>
</h1>
<nav class="site-nav">
  <ul>
    <li><a target="_self" href="index.html">About</a></li>
    <li><a target="_self" href="news.html">News</a></li>
    <li><a target="_self" href="research.html">Research</a></li>
    <li><a target="_self" href="publications.html">Publications</a></li>
  </ul>
</nav>
<script>
  (function () {
    var name = location.pathname.split('/').pop().replace(/\.html$/, '') || 'index';
    document.body.classList.add('page-' + name);
  })();
</script>

<div id="outline-container-org1538907" class="outline-2">
<h2 id="org1538907">Journal articles</h2>
<div class="outline-text-2" id="text-org1538907">
<div class="pub" id="vaquero_sr2024"><span class="venue">Science Robotics<br>2024</span><div class="body">
<p class="title">EELS: Autonomous snake-like robot with task and motion planning capabilities for ice world exploration</p>
<p class="authors">T. S. Vaquero, G. Daddi, R. Thakker, M. Paton, A. Jasour, M. P. Strub, R. M. Swan, R. Royce, <i>et al.</i></p>
<div class="links"><a href="https://www.science.org/doi/full/10.1126/scirobotics.adh8332">open-access</a> · <a href="https://www.doi.org/10.1126/scirobotics.adh8332">doi</a> · <details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@Article{vaquero_sr2024,
  author = {Vaquero, Tiago S. and Daddi, Guglielmo and Thakker, Rohan and Paton, Michael and Jasour, Akash and Strub, Marlin P. and Swan, R. Michael and Royce, Rob and Gildner, Matthew and Tosi, Phillipe and Veismann, Marcel and Gavrilov, Peter and Marteau, Elo\"{i}se and Bowkett, Joseph and Loret de Mola Lemus, Daniel and Nakka, Yashwanth and Hockman, Ben and Orekhov, Andrew and Hasseler, Tristan D. and Leake, Carl and Nuernberger, Benjamin and Proen\c{c}a, Pedro and Reid, William and Talbot, William and Georgiev, Nikola and Pailevanian, Torkom and Archanian, Avak and Ambrose, Eric and Jasper, Jay and Etheredge, Rachel and Roman, Christian and Levine, Dan and Otsu, Kyon and Yearicks, Sarah and Melikyan, Hovhannes and Rieber, Richard R. and Carpenter, Kalind and Nash, Jeremy and Jain, Abhinandan and Shiraishi, Lori and Robinson, Matt and Travers, Matthew and Choset, Howie and Burdick, Joel W. and Gardner, Alex and Cable, Morgan L. and Ingham, Mitch and Ono, Hiro},
  title = {{EELS}: {Autonomous} snake-like robot with task and motion planning capabilities for ice world exploration},
  journal = {Science Robotics},
  year = {2024},
  volume = {9},
  number = {88},
  pages = {1--11},
  doi = {10.1126/scirobotics.adh8332}
}
</pre>
</div>
</details></div>
</div></div>

<div class="pub" id="thomason_ral2022"><span class="venue">RA-L 2022</span><div class="body">
<p class="title">Task and Motion Informed Trees (TMIT*): Almost-surely asymptotically optimal integrated task and motion planning</p>
<p class="authors">W. Thomason, M. P. Strub, J. D. Gammell</p>
<div class="links"><a href="https://arxiv.org/abs/2210.09367">open-access</a> · <a href="https://www.doi.org/10.1109/LRA.2022.3199676">doi</a> · <details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@Article{thomason_ral2022,
  author = {Thomason, Wil and Strub, Marlin P. and Gammell, Jonathan D.},
  title = {{Task} and {Motion} {Informed} {Trees} ({TMIT*}): Almost-surely asymptotically optimal integrated task and motion planning},
  journal = {{IEEE} Robotics and Automation Letters ({RA-L})},
  year = {2022},
  volume = {7},
  number = {4},
  pages = {11370--11377},
  doi = {10.1109/LRA.2022.3199676}
}
</pre>
</div>
</details></div>
</div></div>

<div class="pub" id="strub_ijrr2021"><span class="venue">IJRR 2022</span><div class="body">
<p class="title">AIT* and EIT*: Asymmetric bidirectional sampling-based path planning</p>
<p class="authors">M. P. Strub, J. D. Gammell</p>
<div class="links"><a href="https://arxiv.org/abs/2111.01877">open-access</a> · <a href="https://www.doi.org/10.1177/02783649211069572">doi</a> · <details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@Article{strub_ijrr2021,
  author = {Strub, Marlin P. and Gammell, Jonathan D.}
  title = {{AIT*} and {EIT*}: {Asymmetric} bidirectional sampling-based path planning},
  journal = {The International Journal of Robotics Research ({IJRR})},
  year = {2022},
  volume = {41},
  number = {4},
  pages = {351--457},
  doi = {10.1177/02783649211069572}
}
</pre>
</div>
</details></div>
</div></div>

<div class="pub" id="gammell_arcras2021"><span class="venue">ARCRAS 2021</span><div class="body">
<p class="title">Asymptotically optimal sampling-based motion planning methods</p>
<p class="authors">J. D. Gammell, M. P. Strub</p>
<div class="links"><a href="https://arxiv.org/abs/2009.10484">open-access</a> · <a href="https://www.doi.org/10.1146/annurev-control-061920-093753">doi</a> · <details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@Article{gammell_arcras2021,
  author = {Gammell, Jonathan D. and Strub, Marlin P.},
  title = {Asymptotically optimal sampling-based motion planning methods},
  journal = {Annual Review of Control, Robotics, and Autonomous Systems},
  year = {2021},
  volume = {4},
  number = {1},
  pages = {295--318},
  doi = {10.1146/annurev-control-061920-093753}
}
</pre>
</div>
</details></div>
</div></div>
</div>
</div>
