publications.html

<div id="outline-container-org2ca0a87" class="outline-2">
<h2 id="org2ca0a87">Conference papers</h2>
<div class="outline-text-2" id="text-org2ca0a87">
<div class="pub" id="jasour_icra2025"><span class="venue">ICRA 2025</span><div class="body">
<p class="title">Risk-aware integrated task and motion planning for versatile snake robots under localization failures</p>
<p class="authors">A. Jasour, G. Daddi, M. Endo, T. S. Vaquero, M. Paton, M. P. Strub, S. Corpino, M. Ingham, M. Ono, R. Thakker</p>
<div class="links"><a href="https://arxiv.org/abs/2502.19690">open-access</a> · <a href="https://www.doi.org/10.1109/ICRA55743.2025.11127363">doi</a> · <details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@InProceedings{jasour_icra2025,
  author = {Jasour, Akash and Daddi, Guglielmo and Endo, Masahiro and Vaquero, Tiago S. and Paton, Michael and Strub, Marlin P. and Corpino, Sabrina and Ingham, Michel and Ono, Masahiro and Thakker, Rohan},
  title = {Risk-aware integrated task and motion planning for versatile snake robots under localization failures},
  booktitle = {Proceedings of the {IEEE} International Conference on Robotics and Automation ({ICRA})},
  year = {2025},
  pages = {8880--8886},
  doi = {10.1109/ICRA55743.2025.11127363}
}
</pre>
</div>
</details></div>
</div></div>

<div class="pub" id="reid_aeroconf2024"><span class="venue">AeroConf 2024</span><div class="body">
<p class="title">Planning and control for autonomous drives of the Mars Sample Recovery Helicopter</p>
<p class="authors">W. Reid, T. Bartlett, A. Bouton, M. P. Strub, M. Newby, S. Gerdts, J. Martin, S. Moreland, R. McCormick</p>
<div class="links"><a href="https://www.doi.org/10.1109/AERO58975.2024.10521039">doi</a> · <details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@InProceedings{reid_aeroconf24,
  author = {Reid, William and Bartlett, Tara and Bouton, Arthur and Strub, Marlin P. and Newby, Michael and Gerdts, Stephen and Martin, Joshua and Moreland, Scott and McCormick, Ryan},
  title = {Planning and control for autonomous drives of the {Mars} sample {Recovery} {Helicopter}},
  booktitle = {Proceedings of the {IEEE} Aerospace Conference ({AeroConf})},
  year = {2024},
  pages = {1--11},
  doi = {10.1109/AERO58975.2024.10521039}
}
</pre>
</div>
</details></div>
</div></div>

<div class="pub" id="paton_aeroconf2024"><span class="venue">AeroConf 2024</span><div class="body">
<p class="title">2023 EELS field tests at Athabasca Glacier as an icy moon analogue environment</p>
<p class="authors">M. Paton, <i>et al.</i> (incl. M. P. Strub)</p>
<div class="links"><a href="https://www.doi.org/10.1109/AERO58975.2024.10521174">doi</a> · <details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@InProceedings{paton_aeroconf2024,
  author = {Paton, Michael and others},
  title = {2023 {EELS} field tests at {Athabasca} {Glacier} as an icy moon analogue environment},
  booktitle = {Proceedings of the {IEEE} Aerospace Conference ({AeroConf})},
  year = {2024},
  pages = {1--18},
  doi = {10.1109/AERO58975.2024.10521174}
}
</pre>
</div>
</details></div>
</div></div>

<div class="pub" id="thakker_aiaa2024"><span class="venue">AIAA 2024</span><div class="body">
<p class="title">To boldly go where no robots have gone before — part 4: Neo autonomy for robustly exploring unknown, extreme environments with versatile robots</p>
<p class="authors">R. Thakker, M. Paton, B. Jones, G. Daddi, R. Royce, M. Swan, M. P. Strub, <i>et al.</i></p>
<div class="links"><a href="https://www.doi.org/10.2514/6.2024-1747">doi</a> · <details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@InProceedings{thakker_aiaa2024,
  author = {Thakker, Rohan and Paton, Michael and Jones, Benjamin and Daddi, Guglielmo and Royce, Rob and Swan, Michael and Strub, Marlin P. and others},
  title = {To boldly go where no robots have gone before -- part 4: {Neo} autonomy for robustly exploring unknown, extreme environments with versatile robots},
  booktitle = {{AIAA} {SCITECH} 2024 Forum},
  year = {2024},
  number = {1747},
  doi = {10.2514/6.2024-1747}
}
</pre>
</div>
</details></div>
</div></div>

<div class="pub" id="thakker_iros2023"><span class="venue">IROS 2023</span><div class="body">
<p class="title">EELS: Towards autonomous mobility in extreme terrain with a versatile snake robot with resilience to exteroception failures</p>
<p class="authors">R. Thakker, M. Paton, M. P. Strub, M. Swan, G. Daddi, R. Royce, <i>et al.</i></p>
<div class="links"><a href="https://ai.jpl.nasa.gov/public/documents/papers/thakker-et-al-iros2023-eels.pdf">open-access</a> · <a href="https://www.doi.org/10.1109/IROS55552.2023.10341448">doi</a> · <details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@InProceedings{thakker_iros23,
  author = {Thakker, Rohan and Paton, Michael and Strub, Marlin P. and Swan, Michael and Daddi, Guglielmo and Royce, Rob and Tosi, Phillipe and Gildner, Matthew and Vaquero, Tiago and Veismann, Marcel and Gavrilov, Peter and Marteau, Eloise Bowkett, Joseph and Loret, Daniel and Nakka, Yashwanth and Hockman, Benjamin and Orekhov, Andrew and Hasseler, Tristan and Leake, Carl and Nuernberger, Benjamin and Proen\c{c}a, Pedro and Reid, William and Talbot, William and Georgiev, Nikola and Pailevanian, Torkom and Archanian, Avak and Ambrose, Eric and Jasper, Jay and Etheredge, Rachel and Roman, Christiahn and Levine, Dan and Otsu, Kyohei and Melikyan, Hovhannes and Nash, Jeremy and Rieber, Richard and Carpenter, Kalind and Jain, Abhinandan and Shiraishi, Lori and Pastor, Daniel and Yearicks, Sarah and Ingham, Michel and Robinson, Matthew and Agha, Ali and Travers, Matthew and Choset, Howie and Burdick, Joel and Ono Masahiro},
  title = {{EELS}: {Towards} autonomous mobility in extreme terrain with a versatile snake robot with resilience to exteroception failures},
  booktitle = {Proceedings of the {IEEE}/{RSJ} International Conference on Intelligent Robots and Systems ({IROS})},
  year = {2023},
}
</pre>
</div>
</details></div>
</div></div>

<div class="pub" id="hartmann_isrr2022"><span class="venue">ISRR 2022</span><div class="body">
<p class="title">Effort Informed Roadmaps (EIRM*): Efficient asymptotically optimal multiquery planning by actively reusing validation effort</p>
<p class="authors">V. N. Hartmann, M. P. Strub, M. Toussaint, J. D. Gammell</p>
<div class="links"><a href="https://arxiv.org/pdf/2205.08480">open-access</a> · <a href="https://www.doi.org/10.1007/978-3-031-25555-7_37">doi</a> · <details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@InProceedings{hartmann_isrr22,
  author = {Hartmann, Valentin N. and Strub, Marlin P. and Toussaint, Marc and Gammell, Jonathan D.},
  title = {{Effort} {Informed} {Roadmaps} ({EIRM*}): {Efficient} asymptotically optimal multiquery planning by actively reusing validation effort},
  booktitle = {Proceedings of the International Symposium on Robotics Research ({ISRR})},
  year = {2022},
  doi = {10.1007/978-3-031-25555-7_37}
}
</pre>
</div>
</details></div>
</div></div>

<div class="pub" id="paton_iros2020"><span class="venue">IROS 2020</span><div class="body">
<p class="title">Navigation on the line: Traversability analysis and path planning for extreme-terrain rappelling rovers</p>
<p class="authors">M. Paton, M. P. Strub, T. Brown, R. J. Greene, J. Lizewski, V. Patel, J. D. Gammell, I. A. D. Nesnas</p>
<div class="links"><a href="https://robotic-esp.com/papers/paton_iros20.pdf">open-access</a> · <a href="https://www.doi.org/10.1109/IROS45743.2020.9341409">doi</a> · <details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@InProceedings{paton_iros2020,
  author = {Paton, Michael and Strub, Marlin P. and Brown, Travis and Greene, Rebecca J. and Lizewski, Jacob and Patel, Vandan and Gammell, Jonathan D. and Nesnas, Issa A.D.},
  title = {Navigation on the line: {Traversability} analysis and path planning for extreme-terrain rappelling rovers},
  booktitle = {Proceedings of the {IEEE}/{RSJ} International Conference on Intelligent Robots and Systems ({IROS})},
  year = {2020},
  pages = {7034--7041},
  doi = {10.1109/IROS45743.2020.9341409}
}
</pre>
</div>
</details></div>
</div></div>

<div class="pub" id="strub_icra2020b"><span class="venue">ICRA 2020</span><div class="body">
<p class="title">Adaptively Informed Trees (AIT*): Fast asymptotically optimal path planning through adaptive heuristics</p>
<p class="authors">M. P. Strub, J. D. Gammell</p>
<div class="links"><a href="https://arxiv.org/abs/2002.06599">open-access</a> · <a href="https://www.doi.org/10.1109/ICRA40945.2020.9197338">doi</a> · <details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@InProceedings{strub_icra2020b,
  author = {Strub, Marlin P. and Gammell, Jonathan D.},
  title = {{Adaptively} {Informed} {Trees} ({AIT*}): {Fast} asymptotically optimal path planning through adaptive heuristics},
  booktitle = {Proceedings of the {IEEE} International Conference on Robotics and Automation ({ICRA})},
  year = {2020},
  pages = {3191--3198},
  doi = {10.1109/ICRA40945.2020.9197338}
}
</pre>
</div>
</details></div>
</div></div>

<div class="pub" id="strub_icra2020a"><span class="venue">ICRA 2020</span><div class="body">
<p class="title">Advanced BIT* (ABIT*): Sampling-based planning with advanced graph-search techniques</p>
<p class="authors">M. P. Strub, J. D. Gammell</p>
<div class="links"><a href="https://arxiv.org/abs/2002.06589">open-access</a> · <a href="https://www.doi.org/10.1109/ICRA40945.2020.9196580">doi</a> · <details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@InProceedings{strub_icra2020a,
  author = {Strub, Marlin P. and Gammell, Jonathan D.},
  title = {{Advanced} {BIT*} ({ABIT*}): {Sampling}-based planning with advanced graph-search techniques},
  booktitle = {Proceedings of the {IEEE} International Conference on Robotics and Automation ({ICRA})},
  year = 2020,
  pages = {130--136},
  doi = {10.1109/ICRA40945.2020.9196580},
}
</pre>
</div>
</details></div>
</div></div>
</div>
</div>
