content/publications.org
* Theses

#+html: <div class="pub" id="strub_phd2022"><span class="venue">PhD 2022</span><div class="body">
#+html: <p class="title">Leveraging multiple sources of information to search continuous spaces</p>
#+html: <p class="authors">M. P. Strub <span class="links">· University of Oxford</span></p>
#+html: <div class="links"><a href="https://ora.ox.ac.uk/objects/uuid:1a241006-0ddd-4829-bdd5-ade7301c863a">open-access</a> · <details><summary>bibtex</summary>
#+begin_src bibtex
@PhDThesis{strub_phd2022,
  author = {Strub, Marlin P.},
  title = {Leveraging multiple sources of information to search continuous spaces},
  school = {University of Oxford},
  year = {2022}
}
#+end_src
#+html: </details></div>
#+html: </div></div>

#+html: <div class="pub" id="strub_msc2017"><span class="venue">MSc 2017</span><div class="body">
#+html: <p class="title">Exploring continuous representation of the world for place recognition</p>
#+html: <p class="authors">M. P. Strub <span class="links">· ETH Zurich</span></p>
#+html: <div class="links"><details><summary>bibtex</summary>
#+begin_src bibtex
@MastersThesis{strub_msc2017,
  author = {Strub, Marlin P.},
  title = {Exploring continuous representation of the world for place recognition},
  school = {ETH Zurich},
  year = {2017}
}
#+end_src
#+html: </details></div>
#+html: </div></div>

#+html: <div class="pub" id="strub_bsc2015"><span class="venue">BSc 2015</span><div class="body">
#+html: <p class="title">Model-based control of a bounding gait for a quadruped robot</p>
#+html: <p class="authors">M. P. Strub <span class="links">· ETH Zurich</span></p>
#+html: <div class="links"><details><summary>bibtex</summary>
#+begin_src bibtex
@MastersThesis{strub_bsc2015,
  author = {Strub, Marlin P.},
  title = {Model-based control of a bounding gait for a quadruped robot},
  type = {Bachelor's Thesis},
  school = {ETH Zurich},
  year = {2015}
}
#+end_src
#+html: </details></div>
#+html: </div></div>

* Workshop papers and technical reports

#+html: <div class="pub" id="gammell_empp22"><span class="venue">EMPP 2022</span><div class="body">
#+html: <p class="title">Planner Developer Tools (PDT): Reproducible experiments and statistical analysis for developing and testing motion planners</p>
#+html: <p class="authors">J. D. Gammell, M. P. Strub, V. N. Hartmann</p>
#+html: <div class="links"><a href="https://robotic-esp.com/papers/gammell_empp22.pdf">open-access</a> · <details><summary>bibtex</summary>
#+begin_src bibtex
@InProceedings{gammell_empp22,
  author = {Gammell, Jonathan D. and Strub, Marlin P. and Hartmann, Valentin N.},
  title = {Planner {Developer} {Tools} ({PDT}): Reproducible experiments and statistical analysis for developing and testing motion planners},
  booktitle = {Proceedings of the Workshop on Evaluating Motion Planning Performance ({EMPP}), {IEEE/RSJ} International Conference on Intelligent Robots and Systems ({IROS})},
  year = {2022}
}
#+end_src
#+html: </details></div>
#+html: </div></div>

#+html: <div class="pub" id="strub_tr2021"><span class="venue">arXiv 2021</span><div class="body">
#+html: <p class="title">Admissible heuristics for obstacle clearance optimization objectives</p>
#+html: <p class="authors">M. P. Strub, J. D. Gammell</p>
#+html: <div class="links"><a href="https://arxiv.org/abs/2104.02298">open-access</a> · <details><summary>bibtex</summary>
#+begin_src bibtex
@TechReport{strub_tr2021,
  author = {Strub, Marlin P. and Gammell, Jonathan D.},
  title = {Admissible heuristics for obstacle clearance optimization objectives},
  institution = {Estimation, Search, and Planning (ESP) Research Group, University of Oxford},
  number = {TR-2021-MPS001},
	note = {arXiv:2104.02298 [cs.RO]},
	year = {2021}
}
#+end_src
#+html: </details></div>
#+html: </div></div>
