publications.html

<div id="outline-container-orgec9be28" class="outline-2">
<h2 id="orgec9be28">Theses</h2>
<div class="outline-text-2" id="text-orgec9be28">
<div class="pub" id="strub_phd2022"><span class="venue">PhD 2022</span><div class="body">
<p class="title">Leveraging multiple sources of information to search continuous spaces</p>
<p class="authors">M. P. Strub <span class="links">· University of Oxford</span></p>
<div class="links"><a href="https://ora.ox.ac.uk/objects/uuid:1a241006-0ddd-4829-bdd5-ade7301c863a">open-access</a> · <details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@PhDThesis{strub_phd2022,
  author = {Strub, Marlin P.},
  title = {Leveraging multiple sources of information to search continuous spaces},
  school = {University of Oxford},
  year = {2022}
}
</pre>
</div>
</details></div>
</div></div>

<div class="pub" id="strub_msc2017"><span class="venue">MSc 2017</span><div class="body">
<p class="title">Exploring continuous representation of the world for place recognition</p>
<p class="authors">M. P. Strub <span class="links">· ETH Zurich</span></p>
<div class="links"><details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@MastersThesis{strub_msc2017,
  author = {Strub, Marlin P.},
  title = {Exploring continuous representation of the world for place recognition},
  school = {ETH Zurich},
  year = {2017}
}
</pre>
</div>
</details></div>
</div></div>

<div class="pub" id="strub_bsc2015"><span class="venue">BSc 2015</span><div class="body">
<p class="title">Model-based control of a bounding gait for a quadruped robot</p>
<p class="authors">M. P. Strub <span class="links">· ETH Zurich</span></p>
<div class="links"><details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@MastersThesis{strub_bsc2015,
  author = {Strub, Marlin P.},
  title = {Model-based control of a bounding gait for a quadruped robot},
  type = {Bachelor's Thesis},
  school = {ETH Zurich},
  year = {2015}
}
</pre>
</div>
</details></div>
</div></div>
</div>
</div>

<div id="outline-container-orgd66ab51" class="outline-2">
<h2 id="orgd66ab51">Workshop papers and technical reports</h2>
<div class="outline-text-2" id="text-orgd66ab51">
<div class="pub" id="gammell_empp22"><span class="venue">EMPP 2022</span><div class="body">
<p class="title">Planner Developer Tools (PDT): Reproducible experiments and statistical analysis for developing and testing motion planners</p>
<p class="authors">J. D. Gammell, M. P. Strub, V. N. Hartmann</p>
<div class="links"><a href="https://robotic-esp.com/papers/gammell_empp22.pdf">open-access</a> · <details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@InProceedings{gammell_empp22,
  author = {Gammell, Jonathan D. and Strub, Marlin P. and Hartmann, Valentin N.},
  title = {Planner {Developer} {Tools} ({PDT}): Reproducible experiments and statistical analysis for developing and testing motion planners},
  booktitle = {Proceedings of the Workshop on Evaluating Motion Planning Performance ({EMPP}), {IEEE/RSJ} International Conference on Intelligent Robots and Systems ({IROS})},
  year = {2022}
}
</pre>
</div>
</details></div>
</div></div>

<div class="pub" id="strub_tr2021"><span class="venue">arXiv 2021</span><div class="body">
<p class="title">Admissible heuristics for obstacle clearance optimization objectives</p>
<p class="authors">M. P. Strub, J. D. Gammell</p>
<div class="links"><a href="https://arxiv.org/abs/2104.02298">open-access</a> · <details><summary>bibtex</summary>
<div class="org-src-container">
<pre class="src src-bibtex">@TechReport{strub_tr2021,
  author = {Strub, Marlin P. and Gammell, Jonathan D.},
  title = {Admissible heuristics for obstacle clearance optimization objectives},
  institution = {Estimation, Search, and Planning (ESP) Research Group, University of Oxford},
  number = {TR-2021-MPS001},
        note = {arXiv:2104.02298 [cs.RO]},
        year = {2021}
}
</pre>
</div>
</details></div>
</div></div>
</div>
</div>
</div>
<div id="postamble" class="status">
<nav class="site-footer">
<a href="mailto:marlin.strub@gmail.com"><svg viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" aria-hidden="true"><path d="M3 7a2 2 0 0 1 2 -2h14a2 2 0 0 1 2 2v10a2 2 0 0 1 -2 2h-14a2 2 0 0 1 -2 -2v-10z"/><path d="M3 7l9 6l9 -6"/></svg>Email</a>
<span class="separator">·</span>
<a href="https://github.com/marlinstrub"><svg viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" aria-hidden="true"><path d="M9 19c-4.3 1.4 -4.3 -2.5 -6 -3m12 5v-3.5c0 -1 .1 -1.4 -.5 -2c2.8 -.3 5.5 -1.4 5.5 -6a4.6 4.6 0 0 0 -1.3 -3.2a4.2 4.2 0 0 0 -.1 -3.2s-1.1 -.3 -3.5 1.3a12.3 12.3 0 0 0 -6.2 0c-2.4 -1.6 -3.5 -1.3 -3.5 -1.3a4.2 4.2 0 0 0 -.1 3.2a4.6 4.6 0 0 0 -1.3 3.2c0 4.6 2.7 5.7 5.5 6c-.6 .6 -.6 1.2 -.5 2v3.5"/></svg>GitHub</a>
<span class="separator">·</span>
<a href="https://linkedin.com/in/marlinstrub"><svg viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" aria-hidden="true"><path d="M4 4m0 2a2 2 0 0 1 2 -2h12a2 2 0 0 1 2 2v12a2 2 0 0 1 -2 2h-12a2 2 0 0 1 -2 -2z"/><path d="M8 11l0 5"/><path d="M8 8l0 .01"/><path d="M12 16l0 -5"/><path d="M16 16v-3a2 2 0 0 0 -4 0"/></svg>LinkedIn</a>
</nav>
</div>
</body>
</html>
